lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_time.c
    if (value == 0ULL) {
        const uint32_t hi =
            NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH &
            GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
        const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
        value = ((uint64_t)hi << 32U) | (uint64_t)lo;
    }

    if (restoreActive) {
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
    }

    return value;
}

static void busyWaitApproxUs(uint32_t us)
{
    uint32_t cyclesPerUs = SystemCoreClock / 1000000UL;
    if (cyclesPerUs == 0UL) {
        cyclesPerUs = 64UL;
    }

    uint32_t iterations = cyclesPerUs * us;
    if (iterations == 0UL) {
        iterations = 1UL;
    }

    while (iterations-- > 0UL) {
        __NOP();
    }
}

static void ensureGrtcReady(NRF_GRTC_Type* grtc)
{
    grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;
    __asm volatile("dsb 0xF" ::: "memory");
    delayMicroseconds(kGrtcStartSettleUs);

    const uint32_t active =
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE & GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk;
    const bool restoreActive =
        active == (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive
                   << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    if (restoreActive) {
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
    }

    while (!grtcSyscounterReady(grtc)) {
        __NOP();
    }

    if (restoreActive) {
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
    }
}

static uint64_t readGrtcCounterUs(NRF_GRTC_Type* grtc)
{
    return readGrtcCounterPreserveActive(grtc);
}

#if defined(NRF54L15_CLEAN_POWER_LOW)
#ifdef NRF_TRUSTZONE_NONSECURE
#define NRF54L15_CLEAN_GRTC_BASE 0x400E2000UL
#else
#define NRF54L15_CLEAN_GRTC_BASE 0x500E2000UL
#endif
static NRF_GRTC_Type* const g_low_power_grtc =
    (NRF_GRTC_Type*)NRF54L15_CLEAN_GRTC_BASE;
// On XIAO nRF54L15 secure CPUAPP, the Zephyr-derived allowed mask is 0x67
// (channels 0,1,2,5,6). Choose a non-conflicting tickless wake source at
// runtime because BLE background scheduling owns several GRTC compare channels.
// Channel 0 enumerates as allowed but does not reliably wake CPUAPP here, so
// prefer the highest non-BLE channel left in the board-allowed mask.
enum { kLowPowerDelayInvalidChannel = 0xFFU };
static volatile uint8_t g_low_power_delay_fired = 0U;
static volatile uint8_t g_low_power_timebase_initialized = 0U;
static uint8_t g_low_power_delay_channel = kLowPowerDelayInvalidChannel;

static uint32_t lowPowerAllCcMask(void)
{
    if (GRTC_CC_MaxCount >= 32U) {
        return 0xFFFFFFFFUL;
    }
    return (1UL << GRTC_CC_MaxCount) - 1UL;
}

static uint64_t readLowPowerCounterUs(void)
{
    return readGrtcCounterPreserveActive(g_low_power_grtc);
}

static void lowPowerDisarmDelayWake(void)
{
    if (g_low_power_delay_channel == kLowPowerDelayInvalidChannel) {
        return;
    }
    NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) = (1UL << g_low_power_delay_channel);
    g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
}

static void lowPowerArmDelayWake(uint64_t targetUs)
{
    if (g_low_power_delay_channel == kLowPowerDelayInvalidChannel) {
        return;
    }
    const uint32_t lo = (uint32_t)(targetUs & 0xFFFFFFFFULL);
    const uint32_t hi = (uint32_t)((targetUs >> 32U) & 0xFFFFFUL);

    g_low_power_delay_fired = 0U;
    g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
    g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    g_low_power_grtc->CC[g_low_power_delay_channel].CCL = lo;
    g_low_power_grtc->CC[g_low_power_delay_channel].CCH =
        (hi << GRTC_CC_CCH_CCH_Pos) & GRTC_CC_CCH_CCH_Msk;
    NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
        (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    NRF54L15_GRTC_INTENSET_REG(g_low_power_grtc) = (1UL << g_low_power_delay_channel);
    g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Enable << GRTC_CC_CCEN_ACTIVE_Pos);
}

static void initLowPowerTimebase(void)
{
    if (g_low_power_timebase_initialized != 0U) {
        return;
    }

    ensureSystemOffLfxoRunning();

    uint32_t clkcfg = g_low_power_grtc->CLKCFG;
    clkcfg &= ~GRTC_CLKCFG_CLKSEL_Msk;
    clkcfg |= (GRTC_CLKCFG_CLKSEL_LFXO << GRTC_CLKCFG_CLKSEL_Pos);
    g_low_power_grtc->CLKCFG = clkcfg;

    g_low_power_grtc->TIMEOUT =
        (((uint32_t)kLowPowerDelayTimeoutLfclk << GRTC_TIMEOUT_VALUE_Pos) &
         GRTC_TIMEOUT_VALUE_Msk);
    g_low_power_grtc->WAKETIME =
        (((uint32_t)kLowPowerDelayWakeLfclk << GRTC_WAKETIME_VALUE_Pos) &
         GRTC_WAKETIME_VALUE_Msk);
    g_low_power_grtc->MODE =
        (GRTC_MODE_AUTOEN_CpuActive << GRTC_MODE_AUTOEN_Pos) |
        (GRTC_MODE_SYSCOUNTEREN_Enabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    g_low_power_grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;

    // GRTC state can survive in ways that matter across debug/program cycles.
    // Clear the whole interrupt/event group before using the low-power delay
    // channel, or a stale compare event on another channel can trap the CPU in
    // the IRQ.
    const uint32_t bleReservedMask =
        (nrf54l15_ble_grtc_reserved_cc_mask != 0)
            ? nrf54l15_ble_grtc_reserved_cc_mask()
            : 0U;
    uint32_t availableMask = lowPowerAllCcMask() & ~bleReservedMask;
#if defined(ARDUINO_XIAO_NRF54L15)
    availableMask &= kZephyrAllowedCcMaskXiao;
#endif
    g_low_power_delay_channel =
        (availableMask != 0U) ? highestSetBit(availableMask)
                              : kLowPowerDelayInvalidChannel;
    NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
        0xFFFFFFFFUL & ~bleReservedMask;
    for (uint8_t channel = 0; channel < GRTC_CC_MaxCount; ++channel) {
        if ((bleReservedMask & (1UL << channel)) != 0U) {
            continue;
        }
        g_low_power_grtc->CC[channel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        g_low_power_grtc->EVENTS_COMPARE[channel] = 0U;
    }

    if (g_low_power_delay_channel != kLowPowerDelayInvalidChannel) {
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
        NVIC_SetPriority(kLowPowerTickIrq, 3U);
        NVIC_EnableIRQ(kLowPowerTickIrq);
    }
    g_low_power_timebase_initialized = 1U;
}

void nrf54l15_core_bootstrap_low_power_timebase(void)
{
    initLowPowerTimebase();
}

static void delayUntilLowPowerCounterUs(uint64_t targetUs)
{
    if ((__get_PRIMASK() & 1U) != 0U) {
        while ((int64_t)(targetUs - readLowPowerCounterUs()) > 0) {
            nrf54l15_clean_idle_service();
            __NOP();
        }
        return;
    }

    while ((int64_t)(targetUs - readLowPowerCounterUs()) > 0) {
        nrf54l15_clean_idle_service();
        uint64_t sleepTargetUs = targetUs;
        uint8_t skipWfi = 0U;
        if (nrf54l15_clean_ble_idle_sleep_cap_us != 0) {
            // BLE link setup, scanning, and notify/ATT flows are pump-driven in
            // the current CPUAPP path. Sleep in short slices while BLE is
            // active so WFI idle does not starve that state machine.
            const uint32_t sleepCapUs = nrf54l15_clean_ble_idle_sleep_cap_us();
            if (sleepCapUs <= 1U) {
                skipWfi = 1U;
            } else {
                const uint64_t cappedTargetUs =
                    readLowPowerCounterUs() + (uint64_t)sleepCapUs;
                if ((int64_t)(targetUs - cappedTargetUs) > 0) {
                    sleepTargetUs = cappedTargetUs;
                }
            }
        }
        if (skipWfi != 0U) {
            __NOP();
            continue;
        }
        if (g_low_power_delay_channel == kLowPowerDelayInvalidChannel) {
            __NOP();
            continue;
        }
        lowPowerArmDelayWake(sleepTargetUs);
        const uint32_t restoreRaw = beginIdleSleep();
        while ((g_low_power_delay_fired == 0U) &&
               ((int64_t)(sleepTargetUs - readLowPowerCounterUs()) > 0)) {
            __asm volatile("wfi");
        }
        endIdleSleep(restoreRaw);
        lowPowerDisarmDelayWake();
    }
}
#endif

