lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_time.c
        if (grtc->EVENTS_COMPARE[wakeChannel] == 0U) {
            return;
        }

        const uint64_t now = readGrtcCounterUs(grtc);
        if (wakeTimestamp > now) {
            grtc->EVENTS_COMPARE[wakeChannel] = 0U;
            return;
        }

        wakeDelayUs += minimumLatencyUs;
    }
}

static void enterTimedSystemOff(bool disableRamRetention, uint32_t delayUs)
{
    programSystemOffWakeUs(delayUs);
    nrf54l15_core_prepare_system_off();
    if (disableRamRetention) {
        nrf54l15_core_disable_system_off_retention();
    }

    __asm volatile("cpsid i" ::: "memory");
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");
    NRF_RESET->RESETREAS = 0xFFFFFFFFUL;
    __asm volatile("dsb 0xF" ::: "memory");

    NRF_REGULATORS->SYSTEMOFF = REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter;
    __asm volatile("dsb 0xF" ::: "memory");
    while (true) {
        __asm volatile("wfe");
    }
}

void __attribute__((weak)) SysTick_Handler(void)
{
    ++g_millis_ticks;
}

void initSysTick(void)
{
    SystemCoreClockUpdate();

    uint32_t ticks = SystemCoreClock / 1000UL;
    if (ticks == 0UL) {
        ticks = 64000UL;
    }

    SysTick->CTRL = 0;
    SysTick->LOAD = ticks - 1UL;
    SysTick->VAL = 0UL;
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                    SysTick_CTRL_TICKINT_Msk |
                    SysTick_CTRL_ENABLE_Msk;
}

unsigned long millis(void)
{
    return (unsigned long)g_millis_ticks;
}

unsigned long micros(void)
{
    uint32_t ms_a;
    uint32_t ms_b;
    uint32_t val;
    uint32_t load;

    do {
        ms_a = g_millis_ticks;
        val = SysTick->VAL;
        ms_b = g_millis_ticks;
    } while (ms_a != ms_b);

    load = SysTick->LOAD + 1UL;
    uint32_t elapsed = load - val;
    uint32_t cycles_per_us = (SystemCoreClock == 0UL) ? 64UL : (SystemCoreClock / 1000000UL);
    if (cycles_per_us == 0UL) {
        cycles_per_us = 64UL;
    }

    return (unsigned long)(ms_a * 1000UL + (elapsed / cycles_per_us));
}

void delay(unsigned long ms)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

    if (nrf54l15_clean_ble_idle_sleep_cap_us != 0U) {
        const unsigned long startMs = millis();
        while ((millis() - startMs) < ms) {
            nrf54l15_clean_idle_service();
            __NOP();
        }
        return;
    }

    initLowPowerTimebase();
    // Keep plain delay() Arduino-compatible. Sketches may hold board-control
    // rails such as VBAT_EN, RF_SW, or IMU_MIC_EN asserted across delay()
    // and expect that state to remain live during the sleep interval.
    // delayLowPowerIdle() is the explicit helper that collapses and restores
    // the XIAO board rails for lowest-current idle windows.
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    delayUntilLowPowerCounterUs(targetUs);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        __NOP();
    }
#endif
}

void delayLowPowerIdle(unsigned long ms)
{
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

    xiao_nrf54l15_board_state_t boardState;
    const uint8_t boardStateActive = delayBoardStateEnter(&boardState);

#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    delayUntilLowPowerCounterUs(targetUs);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        if ((__get_PRIMASK() & 1U) != 0U) {
            __NOP();
            continue;
        }

        const uint32_t restoreRaw = beginIdleSleep();
        __asm volatile("wfi");
        endIdleSleep(restoreRaw);
    }
#endif

    delayBoardStateExit(&boardState, boardStateActive);
}

void delaySystemOff(unsigned long ms)
{
    uint32_t delayUs = (uint32_t)ms;
    if (delayUs > (0xFFFFFFFFUL / 1000UL)) {
        delayUs = 0xFFFFFFFFUL / 1000UL;
    }
    enterTimedSystemOff(false, delayUs * 1000UL);
}

void delaySystemOffNoRetention(unsigned long ms)
{
    uint32_t delayUs = (uint32_t)ms;
    if (delayUs > (0xFFFFFFFFUL / 1000UL)) {
        delayUs = 0xFFFFFFFFUL / 1000UL;
    }
    enterTimedSystemOff(true, delayUs * 1000UL);
}

void delayMicroseconds(unsigned int us)
{
    const unsigned long start = micros();
    while ((micros() - start) < (unsigned long)us) {
        __NOP();
    }
}

void nrf54l15_core_prepare_system_off(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (g_low_power_timebase_initialized != 0U) {
        if (g_low_power_delay_channel != kLowPowerDelayInvalidChannel) {
            NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
                (1UL << g_low_power_delay_channel);
            g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
                (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
            g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
        }
        NVIC_DisableIRQ(kLowPowerTickIrq);
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    }
#endif

    clearSystemOffVprRetention();
#if defined(ARDUINO_XIAO_NRF54L15)
    xiaoNrf54l15EnterLowestPowerBoardState();
#endif
    SysTick->CTRL = 0U;
}

void nrf54l15_core_disable_system_off_retention(void)
{
    disableSystemOffRetention();
}
